kayas257/PSOC4_TFT/Design01.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "D_C.h"
#include "D_C_aliases.h"
#include "CS.h"
#include "CS_aliases.h"
#include "SCK.h"
#include "SCK_aliases.h"
#include "SDA.h"
#include "SDA_aliases.h"
#include "SPIM.h"
#include "SPIM_PVT.h"
#include "RTC.h"
#include "rst.h"
#include "rst_aliases.h"
#include "ring.h"
#include "ring_aliases.h"
#include "PWM.h"
#include "Clock_1.h"
#include "LED.h"
#include "LED_aliases.h"
#include "SW_Tx_UART_1.h"
#include "SW_Tx_UART_1_PVT.h"
#include "UART_1.h"
#include "UART_1_SPI_UART.h"
#include "UART_1_PINS.h"
#include "UART_1_SPI_UART_PVT.h"
#include "UART_1_PVT.h"
#include "UART_1_BOOT.h"
#include "SPIM_IntClock.h"
#include "UART_1_SCBCLK.h"
#include "UART_1_tx.h"
#include "UART_1_tx_aliases.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"

/*[]*/

